fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	
	// Ксения процедура  
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;

	Если ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ВКМ_ДатаНачалаДействияДоговора = Неопределено;
		ВКМ_ДатаОкончанияДействияДоговора = Неопределено;
		ВКМ_СтоимостьЧасаРаботы = Неопределено;
		ВКМ_СуммаАбонентскойПлаты = Неопределено;
	КонецЕсли;
	// Ксения процедура 

КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Ксения процедура	
	РеквизитыАбонентскогоОбслуживания = Новый Массив;
	РеквизитыАбонентскогоОбслуживания.Добавить("ВКМ_ДатаНачалаДействияДоговора");
	РеквизитыАбонентскогоОбслуживания.Добавить("ВКМ_ДатаОкончанияДействияДоговора");
	РеквизитыАбонентскогоОбслуживания.Добавить("ВКМ_СуммаАбонентскойПлаты");
	РеквизитыАбонентскогоОбслуживания.Добавить("ВКМ_СтоимостьЧасаРаботы");
		
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеРеквизиты, РеквизитыАбонентскогоОбслуживания, Истина);
		Если ВКМ_ДатаОкончанияДействияДоговора < ВКМ_ДатаНачалаДействияДоговора Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата начала действия договора меньше даты окончания!'"));
			Отказ = Истина;
		КонецЕсли;
	Иначе
		ПроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ПроверяемыеРеквизиты, РеквизитыАбонентскогоОбслуживания);
	КонецЕсли;
	// Ксения процедура
		
КонецПроцедуры
#КонецОбласти
	
#КонецЕсли
